package com.njusc.npm.utils.enumeration;
/**
 * 运维管理员操作日志枚举类
 */
public enum OpertateFunctionEnum {
	//----------------登录begin-----------------------//
	systemLogin("系统登录"),
	//----------------登录end-----------------------//
	
	//----------------修改密码begin-----------------------//
	modifyPassword("修改密码"),
	//----------------修改密码end-----------------------//
	
	//----------------会员管理begin-----------------------//
	resetPassword("重置密码"),
	enableAccount("启用账号"),
	disableAccount("停用账号"),
	removeAbnormal("解除异常"),
	//----------------会员管理end-----------------------//
	
	//----------------回访服务begin-----------------------//
	lockReturn("锁定回访"),
	unlockReturn("解锁回访"),
	//----------------回访服务end-----------------------//
	
	//----------------贷款申请begin-----------------------//
	
	//----------------贷款申请end-----------------------//
	
	//----------------贷款使用begin-----------------------//
	
	//----------------贷款使用end-----------------------//
	
	
	
	//----------------解压管理begin-----------------------//
	
	//----------------解压管理end-----------------------//
	
	
	//----------------违约管理begin-----------------------//
	
	//----------------违约管理end-----------------------//
	
	//----------------商户管理begin-----------------------//
	addShopper("添加商户"),
	addBankCard("添加银行卡"),
	editShopper("修改商户"),
	deleteBankCard("删除银行卡"),
	shopperAuditing("商户审核"),
	enableSAccount("启用商户账号"),
	disableSAccount("禁用商户账号"),
	resetShopperPwd("重置商户密码"),
	//----------------商户管理end-----------------------//
	
	//----------------交易记录管理begin-----------------------//
	
	//----------------交易记录管理end-----------------------//
	
	//----------------产权交易统计begin-----------------------//
	ecportExcel("导出excel"),
	//----------------产权交易统计end-----------------------//
	
	//----------------价格趋势分析begin-----------------------//
	
	//----------------价格趋势分析end-----------------------//
	
	
	//----------------贷款统计报表begin-----------------------//
	
	//----------------贷款统计报表end-----------------------//
	
	
	
	//----------------交易统计报表begin-----------------------//
	
	//----------------交易统计报表end-----------------------//
	
	
	
	//----------------贷款统计分析begin-----------------------//
	
	//----------------贷款统计分析end-----------------------//
	
	
	
	//----------------交易统计分析begin-----------------------//
	
	//----------------交易统计分析end-----------------------//
	
	
	

	//----------------用户管理begin-----------------------//
	newUser("新增用户"),
	deleteUser("删除用户"),
	modifyUser("修改用户"),
	resetUserPassword("重置用户密码"),
	//----------------用户管理end-----------------------//
	
	
	//----------------功能管理begin-----------------------//
	addModule("添加模块"),
	modifyModule("修改模块"),
	deleteModule("删除模块"),
	//----------------功能管理end-----------------------//
	
	
	//----------------角色管理begin-----------------------//
	addRole("添加角色"),
	modifyRole("修改角色"),
	deleteRole("删除角色"),
	//----------------角色管理end-----------------------//
	
	
	//----------------权限管理begin-----------------------//
	authorize("授权");
	//----------------权限管理end-----------------------//
	
	
	//----------------日志管理begin-----------------------//
	
	//----------------日志管理end-----------------------//
		
		public final String flag;
		private OpertateFunctionEnum(String f){
			this.flag = f;
		}
		public String getFlag() {
			return flag;
		}
		
		
}
